---
kind: type
id: T:Autodesk.Revit.DB.DGNExportOptions
source: html/deca8dc2-439f-9567-9c60-70961b3f7c14.htm
---
# Autodesk.Revit.DB.DGNExportOptions

The export options used by exporting DGN format file.

## Syntax (C#)
```csharp
public class DGNExportOptions : BaseExportOptions
```